Revit 2027 API
DataConversionMonitorScope Class
 This class is used to regsiter an application-supplied object that implements IDataConversionMonitor. Creating the object registers an implementation of IDataConversionMonitor supplied as constructor argument. When the scope object is destroyed, that object is unregistered.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DataConversionMonitorScope
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DataConversionMonitorScope : IDisposable
Public Class DataConversionMonitorScope
	Implements IDisposable
public ref class DataConversionMonitorScope : IDisposable
type DataConversionMonitorScope =
    class
        interface IDisposable
    end
The DataConversionMonitorScope type exposes the following members.
Constructors
Name | Description
DataConversionMonitorScope |  The only constructor. Expects a valid pointer to IDataConversionMonitor.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DataConversionMonitorScope
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace